app/Http/Controllers/ModelTestingController.php

    public function mahasiswaModel(){
        echo "<b>Mahasiswa</b><br>";
        // user -> mahasiswa
        $mahasiswas = User::has('mahasiswa')
            ->with('mahasiswa.jurusan')
            ->with('mahasiswa.dosen.staff.user') // gets dosen wali
            ->get();
---
select * from `jurusans` where `jurusans`.`id` in (1, 2)
select * from `mahasiswas` where `mahasiswas`.`user_id` in (1, 4)
select * from `users` where exists (select * from `mahasiswas` where `users`.`id` = `mahasiswas`.`user_id`)
select `dosens`.*, `staffs`.`user_id` as `laravel_through_key` from `dosens` inner join `staffs` on `staffs`.`nip` = `dosens`.`staff_nip` where `staffs`.`user_id` in (1, 4)

    public function mahasiswaKonversiModel(){
        echo "<b>Mahasiswa Konversi</b><br>";

        $mahasiswa_konversis = User::has('mahasiswa_konversi')
            ->with('mahasiswa.mahasiswa_konversi.matakuliah_konversis.matakuliah')->get();
---
select `mahasiswa_konversis`.*, `mahasiswas`.`user_id` as `laravel_through_key` from `mahasiswa_konversis` inner join `mahasiswas` on `mahasiswas`.`npm` = `mahasiswa_konversis`.`mahasiswa_npm` where `mahasiswas`.`user_id` = 1 limit 1
select * from `mahasiswas` where `mahasiswas`.`user_id` in (1, 10)
select * from `matakuliah_konversis` where `matakuliah_konversis`.`mahasiswa_konversi_id` in (1, 2)
select * from `matakuliahs` where `matakuliahs`.`id` in (2, 4)

    public function staffModel(){

        echo "<b>Staff</b><br>";
        // user -> staff
        $staffs = User::has('staff')->with('staff')->get();
---
select * from `staffs` where `staffs`.`user_id` in (5, 6)
select * from `users` where exists (select * from `staffs` where `users`.`id` = `staffs`.`user_id`)

    public function dosenModel(){

        echo "<b>Dosen</b><br>";
        // user has one dosen trough staff
        $dosens = User::has('dosen')
            ->with('staff.dosen.jurusan') // take dosen's jurusan
            ->with('dosen.mahasiswas')->get(); // take dosen's mahasiswa wali
---
select * from `jurusans` where `jurusans`.`id` in (1)
select * from `staffs` where `staffs`.`user_id` in (6)
select `dosens`.*, `staffs`.`user_id` as `laravel_through_key` from `dosens` inner join `staffs` on `staffs`.`nip` = `dosens`.`staff_nip` where `staffs`.`user_id` in (6)

    public function jurusanModel(){

        echo "<b>Jurusan</b><br>";

        $jurusans = Jurusan::with('dosens.staff.user')->get();
---
select * from `dosens` where `dosens`.`jurusan_id` in (1, 2)
select * from `jurusans`
select * from `users` where `users`.`id` in (6)

    public function kurikulumModel(){

        echo "<b>Kurikulum</b><br>";

        $kurikulums = Kurikulum::all();
---
select * from `kurikulums`

    public function matakuliahModel() {

        echo "<b>Matakuliah</b><br>";

        $matakuliahs = Matakuliah::with('kurikulum')
        ->with('matakuliah_jurusan.jurusan')
        ->with('prasyarats')
        ->get();
---
select * from `jurusans` where `jurusans`.`id` in (1, 2)
select * from `kurikulums` where `kurikulums`.`id` in (2020)
select * from `matakuliah_jurusans` where `matakuliah_jurusans`.`matakuliah_id` in (1, 2, 4)
select `matakuliahs`.*, `prasyarat`.`matakuliah_id` as `pivot_matakuliah_id`, `prasyarat`.`prasyarat_id` as `pivot_prasyarat_id` from `matakuliahs` inner join `prasyarat` on `matakuliahs`.`id` = `prasyarat`.`prasyarat_id` where `prasyarat`.`matakuliah_id` in (1, 2, 4)

    public function tahunAjaranModel(){

        echo "<b>Tahun Ajaran</b><br>";

        $tahun_ajarans = TahunAjaran::all();
---
select * from `tahun_ajarans`

    public function ruanganModel(){

        echo "<b>Ruangan</b><br>";

        $ruangans = Ruangan::all();
---
select * from `ruangans`

    public function jadwalModel(){

        echo "<b>Jadwal</b><br>";

        $jadwals = Jadwal::with('matakuliah')
        ->with('ruangan')
        ->with('tahun_ajaran')
        ->get();
---
select * from `jadwals`
select * from `matakuliahs` where `matakuliahs`.`id` in (1, 2, 4)
select * from `ruangans` where `ruangans`.`id` in (1, 2)
select * from `tahun_ajarans` where `tahun_ajarans`.`id` in (1, 2)